---
kind: property
id: P:Autodesk.Revit.DB.ThermalAsset.Compressibility
source: html/85514741-351d-8888-a067-292d4cb0ed7c.htm
---
# Autodesk.Revit.DB.ThermalAsset.Compressibility Property

The compressibility of the asset.

## Syntax (C#)
```csharp
public double Compressibility { get; set; }
```

## Remarks
Values must be in the range 0 to 1.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The given value for compressibility is out of range